; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-7-6)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-1 - location
	p0-3 - location
	p0-4 - location
	p1-0 - location
	p1-2 - location
	p1-3 - location
	p2-0 - location
	p2-4 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s2)
	(at driver3 s2)
	(at driver4 s0)
	(at driver5 s3)
	(at truck1 s4)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s0)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s0)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s3)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s1)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at truck6 s3)
	(empty truck6)
	(= (load truck6) 0)
	(= (fuel-per-minute truck6) 10)
	(at truck7 s4)
	(empty truck7)
	(= (load truck7) 0)
	(= (fuel-per-minute truck7) 10)
	(at package1 s2)
	(at package2 s4)
	(at package3 s2)
	(at package4 s0)
	(at package5 s1)
	(at package6 s0)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 93)
	(= (time-to-drive s1 s0) 93)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 70)
	(= (time-to-drive s2 s0) 70)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 20)
	(= (time-to-drive s3 s0) 20)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 26)
	(= (time-to-drive s1 s2) 26)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 9)
	(= (time-to-drive s1 s3) 9)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 67)
	(= (time-to-drive s2 s3) 67)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 32)
	(= (time-to-drive s4 s3) 32)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 59)
	(= (time-to-drive s1 s4) 59)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 78)
	(= (time-to-drive s2 s4) 78)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s0)
	(at driver3 s1)
	(at driver4 s4)
	(at driver5 s0)
	(at truck2 s2)
	(at truck3 s1)
	(at truck4 s4)
	(at package1 s1)
	(at package2 s1)
	(at package3 s0)
	(at package4 s4)
	(at package5 s0)
	(at package6 s1)
	))

(:metric minimize (+ (* 2 (total-time)) (* 1 (fuel-used))))

)

; plan
1. (board-truck driver5 truck4 s3)
   deleted: (at driver5 s3) (empty truck4)
   added: (driving driver5 truck4)
   goals met: 0 of 13
2. (walk driver4 s0 p0-4)
   deleted: (at driver4 s0)
   added: (at driver4 p0-4)
   goals met: 0 of 13
3. (walk driver4 p0-4 s4)
   deleted: (at driver4 p0-4)
   added: (at driver4 s4)
   goals met: 1 of 13
4. (drive-truck truck4 s3 s1 driver5)
   deleted: (at truck4 s3)
   added: (at truck4 s1)
   changed: (fuel-used) from 0 to 90
   goals met: 1 of 13
5. (load-truck package5 truck4 s1)
   deleted: (at package5 s1)
   added: (in package5 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 1 of 13
6. (walk driver2 s2 p2-0)
   deleted: (at driver2 s2)
   added: (at driver2 p2-0)
   goals met: 1 of 13
7. (walk driver2 p2-0 s0)
   deleted: (at driver2 p2-0)
   added: (at driver2 s0)
   goals met: 2 of 13
8. (drive-truck truck4 s1 s2 driver5)
   deleted: (at truck4 s1)
   added: (at truck4 s2)
   changed: (fuel-used) from 90 to 376
   goals met: 2 of 13
9. (load-truck package1 truck4 s2)
   deleted: (at package1 s2)
   added: (in package1 truck4)
   changed: (load truck4) from 1 to 2, (fuel-per-minute truck4) from 11 to 13
   goals met: 2 of 13
10. (load-truck package3 truck4 s2)
   deleted: (at package3 s2)
   added: (in package3 truck4)
   changed: (load truck4) from 2 to 3, (fuel-per-minute truck4) from 13 to 16
   goals met: 2 of 13
11. (drive-truck truck4 s2 s1 driver5)
   deleted: (at truck4 s2)
   added: (at truck4 s1)
   changed: (fuel-used) from 376 to 792
   goals met: 2 of 13
12. (walk driver3 s2 p1-2)
   deleted: (at driver3 s2)
   added: (at driver3 p1-2)
   goals met: 2 of 13
13. (board-truck driver2 truck3 s0)
   deleted: (at driver2 s0) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 1 of 13
14. (walk driver3 p1-2 s1)
   deleted: (at driver3 p1-2)
   added: (at driver3 s1)
   goals met: 2 of 13
15. (unload-truck package1 truck4 s1)
   deleted: (in package1 truck4)
   added: (at package1 s1)
   changed: (load truck4) from 3 to 2, (fuel-per-minute truck4) from 16 to 13
   goals met: 3 of 13
16. (load-truck package6 truck3 s0)
   deleted: (at package6 s0)
   added: (in package6 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 3 of 13
17. (board-truck driver1 truck2 s0)
   deleted: (at driver1 s0) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 3 of 13
18. (drive-truck truck3 s0 s1 driver2)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   changed: (fuel-used) from 792 to 1815
   goals met: 4 of 13
19. (drive-truck truck2 s0 s2 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   changed: (fuel-used) from 1815 to 2515
   goals met: 5 of 13
20. (unload-truck package6 truck3 s1)
   deleted: (in package6 truck3)
   added: (at package6 s1)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 6 of 13
21. (drive-truck truck3 s1 s0 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   changed: (fuel-used) from 2515 to 3445
   goals met: 5 of 13
22. (load-truck package4 truck3 s0)
   deleted: (at package4 s0)
   added: (in package4 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 5 of 13
23. (drive-truck truck3 s0 s1 driver2)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   changed: (fuel-used) from 3445 to 4468
   goals met: 6 of 13
24. (drive-truck truck4 s1 s0 driver5)
   deleted: (at truck4 s1)
   added: (at truck4 s0)
   changed: (fuel-used) from 4468 to 5677
   goals met: 6 of 13
25. (unload-truck package3 truck4 s0)
   deleted: (in package3 truck4)
   added: (at package3 s0)
   changed: (load truck4) from 2 to 1, (fuel-per-minute truck4) from 13 to 11
   goals met: 7 of 13
26. (unload-truck package5 truck4 s0)
   deleted: (in package5 truck4)
   added: (at package5 s0)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 8 of 13
27. (drive-truck truck3 s1 s4 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s4)
   changed: (fuel-used) from 5677 to 6326
   goals met: 7 of 13
28. (unload-truck package4 truck3 s4)
   deleted: (in package4 truck3)
   added: (at package4 s4)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 8 of 13
29. (load-truck package2 truck3 s4)
   deleted: (at package2 s4)
   added: (in package2 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 8 of 13
30. (drive-truck truck3 s4 s1 driver2)
   deleted: (at truck3 s4)
   added: (at truck3 s1)
   changed: (fuel-used) from 6326 to 6975
   goals met: 9 of 13
31. (unload-truck package2 truck3 s1)
   deleted: (in package2 truck3)
   added: (at package2 s1)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 10 of 13
32. (disembark-truck driver5 truck4 s0)
   deleted: (driving driver5 truck4)
   added: (at driver5 s0) (empty truck4)
   goals met: 11 of 13
33. (drive-truck truck3 s1 s0 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   changed: (fuel-used) from 6975 to 7905
   goals met: 10 of 13
34. (disembark-truck driver2 truck3 s0)
   deleted: (driving driver2 truck3)
   added: (at driver2 s0) (empty truck3)
   goals met: 11 of 13
35. (board-truck driver2 truck4 s0)
   deleted: (at driver2 s0) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 10 of 13
36. (drive-truck truck4 s0 s3 driver2)
   deleted: (at truck4 s0)
   added: (at truck4 s3)
   changed: (fuel-used) from 7905 to 8105
   goals met: 10 of 13
37. (drive-truck truck4 s3 s4 driver2)
   deleted: (at truck4 s3)
   added: (at truck4 s4)
   changed: (fuel-used) from 8105 to 8425
   goals met: 11 of 13
38. (disembark-truck driver1 truck2 s2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s2) (empty truck2)
   goals met: 11 of 13
39. (board-truck driver5 truck3 s0)
   deleted: (at driver5 s0) (empty truck3)
   added: (driving driver5 truck3)
   goals met: 10 of 13
40. (drive-truck truck3 s0 s1 driver5)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   changed: (fuel-used) from 8425 to 9355
   goals met: 11 of 13
41. (disembark-truck driver5 truck3 s1)
   deleted: (driving driver5 truck3)
   added: (at driver5 s1) (empty truck3)
   goals met: 11 of 13
42. (walk driver5 s1 p0-1)
   deleted: (at driver5 s1)
   added: (at driver5 p0-1)
   goals met: 11 of 13
43. (walk driver5 p0-1 s0)
   deleted: (at driver5 p0-1)
   added: (at driver5 s0)
   goals met: 12 of 13
44. (disembark-truck driver2 truck4 s4)
   deleted: (driving driver2 truck4)
   added: (at driver2 s4) (empty truck4)
   goals met: 12 of 13
45. (walk driver2 s4 p0-4)
   deleted: (at driver2 s4)
   added: (at driver2 p0-4)
   goals met: 12 of 13
46. (walk driver2 p0-4 s0)
   deleted: (at driver2 p0-4)
   added: (at driver2 s0)
   goals met: 13 of 13
